---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType.ShowPredefined
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType
source: html/d70b0f45-986e-7777-0066-64de63b92741.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType.ShowPredefined

Show text markers only for points that have flag ValueAtPointFlags::DisplayText